# 1. Вывести на экран все числа начиная с 0, пока сумма всех этих чисел не превысит 1000.
# s = 0
# while s < 1000:
#     s += 1
#     print(s)
# 2.
# Пользователь вводит число. Программа завершится, когда пользователь
# введет значение больше 100. Ответ: Вы ввели число больше 100

a = int(input('Ведите любое чесло: '))

while a < 1000000:
    print(a)
    s = int(input('Ведите любое чесло: '))
    if s >= 100:
        break





